<template>
  <div>
    <!-- 顶部 -->
    <div class="fixed-top">
      <van-nav-bar
        :title=" contellationName + '血型' "
        left-arrow
        @click-left="onClickLeft"
        fixed
      >
      </van-nav-bar>
    </div>
    <div class="top-space"></div>
    <div class="white-bg pd10 font-14">
      <van-tabs swipeable sticky :swipe-threshold="6" v-model="tabActive">
        <van-tab v-for="(item, index) in tabList" :title="item.name">
          <h3 class="tcenter pdt10 pdb10">{{item.title}}</h3>
          <van-panel>
            <div slot="header"><h4 class="pdl15 pdr15 pdt10">性格及气质</h4></div>
            <div class="pdl15 pdr15 pdt10 pdb10">
              <p class="desc mgb5">从占星学上来看，摩羯座是属于"地的标志"，象征此型的你，如同大地一般的坚实、稳固及包容。加上A型本身所具有这种特征，因此你不易脱出常轨，就像行驶在正常轨道的列车一样，平稳而顺畅地往前奔驰而去。你凡事认真，因此将所有阻碍前进的享乐，视为不值得的活动，只有努力不懈地迈向未来，才能让心里感觉充实。</p>
              <p class="desc mgb5">你凡事只相信自己，认为这个世界上最靠得住的就是自己，不易对别人敞开胸怀，去相信别人，甚至去接纳别人。这种认真、谨慎的个性可是以从你朴素、踏实的外表上看出来。虽然表面上你与世无争，但并不是消极，在你心中追求名利的野心，正如星星之火在心底烧起来，愈来愈炽烈。由于你对别人的不信任，因此你很少有知心的朋友，生活相当孤独，但是，你对未来充满了信心，相信今日的孤独奋斗定能换取将来的辉煌成就。当别人遇到挫折，就会心灰意冷而裹足不前，你却不易为环境的困顿所击倒，你会以与生俱来的韧性，默默承受，继续以坚定、踏实的步伐，逐步朝成功的目标迈进。不过，你得胜的决心并没有那么明显，你巧取豪夺的技术也没有那么高超，你完全凭着自己的真才实学，比别人更卖力地去从事工作，你坚信以你坚忍不拔的精神和孜孜不倦的工作态度，终有一日，你会爬得比别人高，做得比人更好。成功掌握在你自己的手中，这一点你非常清楚，也愿意努力向前迈进。</p>
              <p class="desc mgb5">你的自尊心极强，如果一旦稍微遇到困难，便停步不前，无异先承认了自己的失败，这是你所无法忍受的事。为达目的对于挫折不屈不挠的坚毅个性，正是你特有的优点，但若是过于呆板，缺乏灵活性，将使你的人际关系发生障碍，反而成了阻力。你愈是身处逆境中，愈能发挥你的潜力，使你成为人人所信赖和尊敬的人。但严以待己的你，也别忘了宽以待人，做事有弹性一些，不要不知变通，让人以为你是老顽固，这样会更有助于人生。你天生便具有努力的精神，因此最后极有可能登上胜利的宝座，接受别人的掌声欢呼。但如果你过于努力，容易给人独善其身的印象，使你的人际关系受损。而且，你若是一味地埋头努力工作，忽略了身旁许多可爱的人和事时，人生岂不单调了些?</p>
              <p class="desc mgb5">忠告：拥有调剂人生的兴趣及嗜好，会使你的生活更加充实。</p>
            </div>
          </van-panel>
          <van-panel>
            <div slot="header"><h4 class="pdl15 pdr15 pdt10">爱与性的倾向</h4></div>
            <div class="pdl15 pdr15 pdt10 pdb10">
              <p class="desc mgb5">你的爱情，如同在黑暗中悄悄绽放的山野小花，没有华丽娇艳的色彩，也没有浓郁的香气，因此很少会有人采摘回家，但你没有一丝抱怨，在遇到理想的伴侣之前，你默默地等待。对任何事情都很谨慎的你，对于爱情也是相当慎重。由于你不大相信别人，对异性更是采取消极的排斥，因此，你的恋情多半迟迟地开花结果，即使你很喜欢对方，你也不会直接表达，只是默默地注视，直到有一天被对方察觉，才会向他倾吐你的爱慕之意。如此富于诗意的恋情，绝不同于瞬间燃烧的爱情，也不像一对花蝴蝶一样，穿梭于花丛中，以汲取爱的蜜汁为乐。你不会想往甜蜜的爱情故事，只求以真实体贴的感情来滋润彼此的心灵，因此，你对爱情的期望，不是急风暴雨般的激情，而是细水长流式的细腻情感。结婚是恋爱的延续，爱情长跑的终点既是步上红毯的那一端。如果你知道双方没有结婚的可能，无论你如何喜爱对方也不会投入感情。你在恋爱上的最大缺点是不擅于表达，加上过强的自制心理，往往不易出现美好的结果。如果能放松心情，勇敢而巧妙地表达出自己的感情，你的爱情将不致遭受挫折。</p>
              <p class="desc mgb5">在你获得心上爱人之后你步入结婚礼堂，并将以往积藏的感情全部倾泻而出以无限的深情来对待自己的伴侣。这种爱意愈来愈为浓烈，绝不会随着岁月的消逝而淡薄。一旦结婚后，以前的顾虑就可以抛开，被压抑的欲望也可获得纾解，你充分享受到性爱的快乐及满足。你原本视性为禁忌，极力压抑，但跟真心相爱的人结合之后，以前任何的束缚都解除了。在性生活方面，你的体验较晚，因为你精神上虽然和对方已紧密地结合在一起，但要发生性关系，则需一段颇长的时间。并非你缺乏性欲，而是你的保守观念及强烈的抑制心，使你不敢纵情而为，因一时的性行动而与对方发生关系。</p>
              <p class="desc mgb5">忠告：不要害怕碰钉子，失败是成功之母，勇敢地向对方表白吧！</p>
            </div>
          </van-panel>
          <van-panel>
            <div slot="header"><h4 class="pdl15 pdr15 pdt10">婚姻及家庭</h4></div>
            <div class="pdl15 pdr15 pdt10 pdb10">
              <p class="desc mgb5">A型摩羯座的你，无论做什么事情都非常谨慎，因此你的恋爱过程极为漫长，多半进入三十岁之后才结婚，是典型的晚婚型。你对婚姻的慎重，可从你计划之心详尽，费时之久远，看出端倪。你不会以爱情为结婚的先决条件，对方如果无法符合你现实生活的种种条件，你绝对不会考虑婚姻。你虽不怎么重视对方的外表，但对于对方的教养、学识、经济能力等却十分重视。内涵重于外表，实际重于虚伪可说是择偶的条件，你的婚姻是不追求罗曼蒂克的现实主义者。男性尤其想娶到一位掌管家务、维持家庭和谐的贤妻良母。因此，你择偶的眼光很少发生偏差，离婚的情形也很少出现。在婚前你或许给对方难以沟通的印象，但一旦组成家庭之后，就会努力做个诚实、负责任的伴侣，非常顾家，任劳任怨，绝无微词。你对孩子也极为疼爱，只要家人快乐，你也就觉得安慰了。</p>
              <p class="desc mgb5">为人妻子的你，应留意自己的装扮及家庭的气氛，把自己的家里装饰得较为柔和、舒适，使辛苦工作一天回到家中的先生，能在你偶尔撒娇的女性温柔中，得以慰藉。作为丈夫的你由于过于严肃，往往给子女带来拘束感，使孩子不敢跟你亲近，家庭的气氛也因此十分沉闷。其实，家庭应是全家人休息的场所，最好能充满自由舒畅的气氛。否则，有谁愿意呆在如牢笼般的家中呢？但因你生活呆板，不擅表达，所以有时必须多对家人说些温柔体贴的话，改变家中的气氛。对你婚姻的评价会随着年龄而增高，亦即年龄愈大，愈能表现出你的优点，是老当益壮，老而弥坚。而年高也不影响你们夫妻的生活，反而愈到晚年，愈懂得享受生活的情趣。</p>
              <p class="desc mgb5">忠告：如果晚婚也不必焦急，或被周围人的意见所左右，最重要的是坚持自己的原则。</p>
            </div>
          </van-panel>
          <van-panel>
            <div slot="header"><h4 class="pdl15 pdr15 pdt10">事业及成功</h4></div>
            <div class="pdl15 pdr15 pdt10 pdb10">
              <p class="desc mgb5">不断努力向上的你，工作能力极为杰出，无论是实务方面的工作，或是艺术方面的工作都能有优异表现。但这种成绩并不是来自天赋，而是你自己勤奋不懈，流血流汗的所换取的。你适合选择如数学家、化学家、教师、药剂师等职业。你所从事的工作都需要活用头脑，而且必须具备高超的智慧及不屈不挠的精神。此外，当宗教家、律师、插花教师、音乐家也颇能称职。</p>
              <p class="desc mgb5">反过来说，不适合你从事的职业有外交官、设计师或与大从传播有关的工作。这些职业都需经常交际应酬，跟你的个性不符，且容易为虚华不实的环境所影响，故宜避免。总之，如果能专心一意致力于工作，就能有卓越的表现，这也是获得成功的关键。</p>
              <p class="desc mgb5">忠告：年轻时的成就虽然有限，但只要贯彻始终地坚持自己所选择的事业，将来必有辉煌的成就。</p>
            </div>
          </van-panel>
          <van-panel>
            <div slot="header"><h4 class="pdl15 pdr15 pdt10">金钱及财运</h4></div>
            <div class="pdl15 pdr15 pdt10 pdb10">
              <p class="desc mgb5">A型魔羯座的你，并不会一夕之间成为人人惊羡不已的暴发户，但由于你对金钱的运用，从年轻时代便会选择一个最稳当的方法，又加上自己勤于储蓄，在守财方面绝没问题。你与生俱来对金钱的感觉便很灵敏，一旦获得钱财，绝不会轻易付出。这种涓滴成河的积财方式，就如滚雪球一样，确实为你累积了财富，不知不觉间可能你就成为一位大财主了。你不喜欢以不正当的手段来赚取巨额财富，同时，你从事赌博及投机事业的运气也不佳，只要你不涉足其间，维持一个小康的生活应不成问题。有时，你会想增加一些收入，而投资其它副业，但通常都会丧失一些财运，甚至连老本都亏损掉，因此，你还是安安分分地在你的本业上尽全力发挥，财运自然会随之而来。</p>
              <p class="desc mgb5">你属于大器晚成的类型，所以年轻时或许为金钱愁苦，但三十岁之后，尤其是过了中年，你的财运会一直上升。虽不致一举致富，但你的耐性及毅力，终能迎头赶上。</p>
              <p class="desc mgb5">忠告：对金钱应适当活用，不宜过于吝啬，以免引起反感。</p>
            </div>
          </van-panel>
        </van-tab>
      </van-tabs>
    </div>
  </div>
</template>
<script>
export default {
  name: 'bloodType',
  components: {
  },
  data () {
    return {
      contellationName: '摩羯座',  // 星座名
      contellationTime: '02/19-03/20', // 星座时间
      tabActive: 0, // 绑定当前选中标签的标识符
      tabList: [ // tab列表
        {
          name: 'AB型',
          title: 'AB型摩羯：勤勉慎重严肃古板',
        },{
          name: 'A型',
          title: 'A型摩羯：坚韧不拔而孜孜不倦',
        },{
          name: 'B型',
          title: 'B型摩羯：吃苦耐劳的进取者',
        },{
          name: 'O型',
          title: 'O型摩羯：埋头苦干的实践者',
        }
      ],
    };
  },
  mounted () {
  },
  computed: {
  },
  methods: {
    onClickLeft(){
      this.COMMONFUNC.goBack();
    },
  },
};
</script>

<style lang="less" scoped>
  .desc{
    text-indent: 0.74rem;
    line-height: 0.7rem;
  }
</style>
