<template>
  <div>
    <van-nav-bar
      title="微撩保证金条约"
      @click-left="onClickLeft"
      left-arrow
      fixed
    />
    <!-- 撑开Fixednav挡住的位置 -->
    <div class="top-space"></div>
    <div>
      本协议由您与广东微撩网络有限公司共同缔结，本协议具有合同效力。
      本协议中协议双方合称协议方，广东微撩网络有限公司在本协议中亦称为“微撩”。
      一、协议内容及生效
      1、本协议内容包括协议正文及所有微撩已经发布或将来可能发布的与“消费者保障服务”相关的规则。前述规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
      2、您应当在实际向其他微撩应用会员(以下简称“买家”)提供消费者保障服务之前认真阅读全部协议内容，对于协议中以加粗字体显示的内容，您应重点阅读。如您对本协议有任何疑问，应向微撩咨询。但无论您事实上是否在向买家提供消费者保障服务之前认真阅读了本协议内容，只要您在线点击签署了本协议，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得微撩对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
      3、您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即结束开店流程或停止店铺经营活动。
      4、微撩有权根据需要不时地制订、修改本协议及/或与“消费者保障服务”相关的规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在微撩应用站公布后，立即自动生效。如您不同意相关变更，应当立即停止店铺经营活动。您继续进行任何店铺经营活动，包括但不限于维持所发布的商品信息，或继续发布商品信息，使用消费者保障服务标识，即表示您接受经修订的协议。
      二、定义
      1、消费者保障服务:指您根据本协议约定的条款和条件及微撩应用(包括但不限于APP等,以下同)其他公示规则的规定，通过微撩应用发布商品信息并利用微撩服务向买家出售全新商品时，应履行商品如实描述义务，在微撩指定期间内保障商品与网上描述不符、商品存在质量问题情形下的权益。
      2、特色服务:指您在承诺消费者保障服务的基础上，根据您的店铺主营类目自愿选择向买家提供的特定服务项目，包括但不限于“数码与家电30天维修服务”、“7天无理由退换货服务”、“假一赔三服务”、“正品保障服务”和“闪电发货服务”。微撩将在微撩应用不时公示新增的服务项目或对原服务项目内容进行修订。关于特色服务内容，由您在选择具体服务项目时和微撩另行约定。
      3、保证金:指您根据本协议约定的条款和条件及微撩应用其他公示规则的规定缴存并冻结于您的微撩账户，在您未履行消费者保障服务承诺时用于对买家进行赔付的资金。根据对应的服务内容不同，保证金分为基础保证金和特色服务保证金。本协议中提及的“保证金”，如无相反约定，均指基础保证金。特色服务保证金的缴存和管理由您和微撩在具体的特色服务协议中另行约定。
      4、微撩服务:微撩服务具体内容，详见您与微撩公司之间签署生效的《微撩服务协议》之约定。
      5、微撩账户:指您使用微撩服务时由微撩公司为您提供的一个唯一的编号，由您自行设置密码，以此查询或计量您的保证金。
      三、消费者保障服务内容
      在您向买家提供消费者保障服务过程中，您承诺遵守以下约定:
      1、您同意遵守本协议、《微撩应用服务协议》、《微撩服务协议》以及所有公示于微撩应用与“消费者保障服务”相关的规则。
      2、您拥有的合法的权利和资格向微撩应用上传有关商品销售信息，且前述行为未对任何第三方合法权益，包括但不限于第三方知识产权、物权等构成侵害。如因您的行为导致微撩或其关联公司遭受任何第三方提起的索赔、诉讼或行政责任，您应承担相应责任并使微撩免责。
      4、您应在商品描述页面、橱窗页面等所有微撩应用提供的渠道中，对上传于微撩应用的商品信息进行如实描述，包括但不限于对商品的基本属性、成色、瑕疵等必须说明的信息进行真实、完整的描述，并对描述的商品信息负有举证责任。您应保证您出售的商品在合理期限内可正常使用，不存在危及人身财产安全的不合理危险，具备商品应当具备的使用性能，符合商品或其包装上注明采用的标准等。
      5、如您在男装、女装/女士精品类目下发布商品，应当使用实物拍摄图片，即您针对该件商品本身实际拍摄的图片，不包括杂志图片、官方网站图片及宣传图片。如您违反本条款之约定，则视为您违反了商品如实描述义务。
      6、您明确了解并同意您是消费者保障服务的责任主体，微撩及其关联公司仅向您提供相关技术支持及服务，不对您向买家提供的消费者保障服务内容承担任何保证责任。
      7、您同意如您出售以下类目商品(微撩将在微撩应用不时公示新增或减少的类目商品)，仍应履行商品如实描述义务，保障买家权益。但微撩有权不介入以下类目商品交易产生的纠纷，您应自行处理您与买家之间可能产生的交易纠纷，“消费者保障服务”或类似文案之标识亦不适用于以下类目商品。本条款之约定不适用于微撩商城商户。
      7.1 宠物/宠物食品及用品&gt;狗、猫、小宠类及用品、水族世界、爬虫类及用品、鸟类及用品、宠物配种/服务、其它;
      7.2 网店/网络服务/个性定制/软件充值&gt;平台软件/加款卡&gt;充值平台加款卡;
      7.3 网络游戏点卡&gt;网游平台(加款卡);
      7.4 成人用品/避孕用品/情趣内衣;
      四、保证金
      您应根据以下条款之约定缴存，并不可撤销地授权微撩及其关联公司有权根据以下条款及微撩应用其他公示规则的规定冻结、使用、处置保证金。本条款之约定不适用于微撩商城商户。
      1、保证金的缴存
      1.1 除手机、国货精品手机、书籍、音像制品类目卖家外，您可在开店流程中，或在“我的微撩”等相关页面自由选择主动缴纳或不缴纳保证金。如您选择主动缴纳保证金，则首次缴纳的保证金金额应不少于1000元人民币。
      1.2 如您未根据上述1.1款之约定选择主动缴纳保证金，则出现以下任一情形时，您必须缴纳相应金额的保证金:
      1.2.1 您违反《微撩规则》，因发生一般违规行为之“描述不符”和/或“违背承诺”任一项或累计扣分满13分，则您应根据如下公式，自收到保证金催缴单之日起七(7)日内足额缴纳相应金额的保证金:保证金额度=1000元人民币×2n(注:2的n次方)
      其中，因发生一般违规行为之“描述不符”和/或“违背承诺”任一项或累计扣分满13分，则n加1，保证金翻倍增加;如最近3个月内一般违规行为和严重违规行为两项累计扣分为0分，则n减1，保证金翻倍减少。本协议有效期内，n数值累计计算，不设上限，不清零。如您因未在收到保证金催缴单之日起十四(14)日内足额缴纳保证金而导致违背承诺扣12分之处罚，则该扣分处罚不计入n增减之数值。
      本条款约定之保证金额度下限为1000元人民币，不设上限。
      1.2.2 您在一个自然月
      3.1.2 没有未完结的退款;
      3.1.3 交易包括但不限于交易产生的纠纷均已处理完毕。
      3.2您需同时符合如下条件，方可申请解冻您根据本条
      1.2.2项之约定强制缴纳的保证金:
      3.2.1 没有未完结的退款;
      3.3 无论您是基于本条任一款项之约定缴纳的保证金，您如同时符合如下条件，均可申请解冻保证金:
      3.3.1 申请解冻之时保证金余额为1000元人民币;
      3.3.2 最近3个月内一般违规行为和严重违规行为两项累计扣分为0分;
      3.3.3 没有未完结的退款;
      3.3.4 交易包括但不限于交易产生的纠纷均已处理完毕。
      3.4 如您最近3个月内一般违规行为和严重违规行为两项累计扣分为0分，且当时您的保证金余额大于1000元人民币，则微撩将直接解冻您根据本条1.2.1项之约定因违规扣分强制增加缴纳的保证金(仅限于1000元人民币以上部分)，具体解冻金额需视您当时n之数值确定。
      3.5 如您未在收到保证金催缴单之日起十四(14)日内足额缴纳相应金额的保证金，且当时您没有未完结的退款，交易包括但不限于交易产生的纠纷均已处理完毕，微撩将直接解冻您剩余的保证金余额，并有权直接终止向您提供全部或部分微撩应用服务。
      3.6 如您在本协议生效之前已缴纳的保证金余额大于1000元人民币的，则本协议生效后，微撩将解冻您已缴纳的1000元人民币以上部分的保证金金额。
      3.7 如您已成功申请解冻保证金，解冻后您的保证金余额为0，或您未在收到保证金催缴单之日起七(7)日内足额缴纳相应金额的保证金，则您橱窗相关页面的“已交保证金”或类似文案之标识将被取消。
      4、保证金的管理与使用
      4.1 您同意，微撩有权在包括但不限于以下情况发生时，向微撩公司就保证金的管理和使用发出指令，处置您的保证金:
      4.1.1 如您在微撩应用发布商品、履行交易相关义务过程中，违反国家法律、法规、政策、微撩应用任何规则或微撩公司的任何规定或违反您对买家的承诺，或被买家申请维权、索赔时，微撩有权根据其独立的判断，无须承担责任地，直接使用保证金对买家进行先行赔付。
      4.1.2 如您违反本协议和/或微撩应用任何规则，给微撩或其关联公司造成任何损失(包括但不限于诉讼赔偿、诉讼费用、律师费用等)的，微撩有权根据其独立的判断，无须承担责任地，直接从保证金中扣除相当于微撩或其关联公司损失的金额，以补偿微撩或其关联公司所遭受的损失。如
      您的保证金余额不足以赔偿的，微撩有权继续向您追偿。在损失金额不明确之前，微撩有权要求微撩公司继续无限期冻结您的保证金，直至损失金额明确后
      予以结算。
      上述4.1.1项规定的赔付程序将按微撩应用不时公布的规则及/或微撩、微撩公司的决定进行。
      4.2 您同意在您与微撩另行签署的特色服务协议项下，如根据该特色服务协议之约定您无需另行缴纳特色服务保证金的，则本条款所述之保证金，可用于该特色服务协议项下的先行赔付之用途。
      4.3 微撩如使用保证金进行任何赔付，将以书面方式(包括但不限于电子邮件、传真等)通知您。在向您出具的书面通知中，将说明赔付原因及赔付金额。
      4.4 如您的保证金余额不足以赔付时，您应自行支付额外的赔付金额。在您保证金余额不足时，微撩没有使用自有资金向买家或者任何第三方支付赔偿金、补偿金或其它任何款项的义务，您仍应对买家或者其他权利人承担赔付、补偿义务。您明确同意如您的保证金余额不足以赔付，且您未自行向买家支付额外的赔付金额时，您不可撤销地委托微撩使用自有资金代您向买家进行赔付。不论是在本协议项下，或是您与微撩另行签署的其它特色服务协议项下，微撩基于您的委托而代为赔付的合计总金额以3000元人民币为上限。此等情形下，微撩有权向您追偿赔付金，包括但不限于采用以下两种方式:
      4.4.1 要求您在微撩赔付后十四(14)日内向微撩偿还与赔付金数额相同的资金，以补偿微撩所遭受的损失，并向买家赔付您实际需赔付金额中的剩余部分(如有)，且在指定时间内补足保证金;或
      4.4.2 要求微撩公司将您微撩帐户下的款项直接支付给微撩，以补偿微撩所遭受的损失;
      如微撩的损失通过上述二种方式仍无法弥补，则微撩有权单方面终止向您提供微撩应用服务，而且继续要求您承担赔偿责任。
      4.5 您对买家、任何第三方以及微撩的赔付责任不以您已缴纳的保证金数额或3000元人民币(取二者较高者)为限。微撩不对买家或者任何第三方承担任何赔付、赔偿义务，但有权根据本协议的规定将您的保证金用于保障对买家或其他权利人的利益。
      五、有限责任
      1、您了解并同意，微撩及其关联公司并非司法机构，仅能以普通或非专业人员的知识水平标准对您提交的证据材料进行鉴别，微撩及其关联公司对交易纠纷的调处完全是基于您的委托，微撩及其关联公司无法保证交易纠纷处理结果符合您的期望，也不对交易纠纷调处结果及保证金赔付决定承担任何责任。您应保证您提交的证据材料的真实性、合法性，并承担您或买家提供的信息、数据不实的风险和责任。如您因此遭受损失，您同意自行向受益人索赔。
      2、您了解并同意，微撩及其关联公司对与本协议相关的以及由于本协议的签
      订、履行导致的所有的、全部的责任，不管是否与违约、侵权相关，也不管由于故意还是过失，也不管您是否向微撩支付过任何费用，在任何情况下，都不应超过3000元人民币，这并不影响微撩根据本协议、微撩与您签署的其它协议、微撩规则享有的免责、责任限制的权利。
      六、协议终止
      1、出现以下情况时，本协议终止。本协议终止后，您将无法继续进行任何橱窗经营活动:
      1.1 自然终止:如您在线签署的《微撩应用服务协议》、《微撩服务协议》因任何原因终止，则本协议将同时终止。
      1.2 通知解除:微撩有权提前十五(15)天以书面通知的方式终止本协议。
      1.3 微撩单方解除权:如您违反本协议中的任何承诺与保证或微撩应用的任何规则，微撩有权立即终止本协议，且按有关规则对您进行处罚。
      1.4 本协议(含规则)变更时，您明示并通知微撩不愿接受新的消费者保障服务协议，则本协议自微撩收到您通知之日起自动终止。
      1.5 本协议规定的其他协议终止条件发生或实现，导致本协议终止。
      2、无论本协议因何原因终止，在协议终止前的行为所导致的任何赔偿和责任，您必须完全且独立地承担责任。即使本协议终止，微撩及其关联公司仍有权根据本协议的规定处理，包括但不限于使用您的保证金来处理因本协议有效期内发生的交易所导致的买家索赔。
      3、本协议第五条及第七条的效力不因本协议的终止而终止。
      七、争议解决
      本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理，并以微撩所在地人民法院为第一审管辖法院。
      八、其他
      1、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。
      2、微撩于您过失或违约时放弃本协议约定的权利的，不得视为微撩对您的其他或以后同类之过失或违约行为弃权。
      3、微撩基于本协议享有的权利以及获得的授权，均可以全部或部分转移、转让、许可、分授权、转授权给任何第三方。未经微撩事先书面同意，您不得将本协议项下的权利义务转让给任何第三方。
          </div>
  </div>
</template>

<script>
  export default {
    components:{
    },
    name: 'marginTreaty',
    data () {
      return {

      };
    },
    mounted () {
    },
    computed: {
    },
    methods: {
      onClickLeft(){
        this.COMMONFUNC.goBack();
      },
    }
  }
</script>
<style lang="css" scoped>

</style>
